IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(20).
01 WS-NUM PIC 9(5).
PROCEDURE DIVISION.
MOVE "John" TO WS-NAME.
DISPLAY WS-NAME.
PERFORM SOME-PARA.
GOTO END-PARA.
STOP RUN.